app/controllers/admin/entries_controller.rb

  def index
    @entries = Entry.all
---
SELECT * FROM "entries"

  def show
    @entry = Entry.find(params[:id])
---
SELECT * FROM "entries" WHERE ("entries"."id" = 953125641)

  def edit
    @entry = Entry.find(params[:id])
---
SELECT * FROM "entries" WHERE ("entries"."id" = 953125641)

  def create
    @entry = Entry.new(params[:entry])

    respond_to do |format|
      if @entry.save
---
INSERT INTO "entries" ("name", "pubDate", "updated_at", "title", "content", "created_at") VALUES('Test', '2009-07-08 00:00:00', '2009-07-08 22:15:27', 'Test', '<div class="summary">

  def update
    @entry = Entry.find(params[:id])
---
SELECT * FROM "entries" WHERE ("entries"."id" = 953125641)

  def destroy
    @entry = Entry.find(params[:id])
    @entry.destroy
---
SELECT * FROM "entries" WHERE ("entries"."id" = 953125641)
DELETE FROM "entries" WHERE "id" = 953125641