app/controllers/home_controller.rb

SELECT * FROM "entries"
---
  def index
    @entries = Entry.page(:published)